Axis_Hagen/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    Inlet
    {
        type            patch;
        nFaces          20;
        startFace       15580;
    }
    Outlet
    {
        type            patch;
        nFaces          20;
        startFace       15600;
    }
    fixedWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       15620;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          8000;
        startFace       16020;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          8000;
        startFace       24020;
    }
    axis
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          0;
        startFace       32020;
    }
)

// ************************************************************************* //
